cc-env/DebianConfigure.html
---
title: Debian&#58; Install 直後の雑多な設定
date: 2017-01-16 23:56:47
layout: cc-env
lang: ja
ref: cc-env/DebianConfigure
permalink: /cc-env/DebianConfigure.html
---


<div id="toc-wrapper">
<nav id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org40dfd00">始めに</a></li>
<li><a href="#org286ce85">sudo の設定</a></li>
<li><a href="#org41d5106">keymap の変更</a></li>
<li><a href="#orgfdca897">MTA の設定</a>
<ul>
<li><a href="#org16f69b6">SSMTP</a></li>
</ul>
</li>
<li><a href="#org5079f0c">alsa の初期設定</a></li>
</ul>
</div>
</nav>
<div class="col-sm-offset-11 col-sm-1 col-xs-offset-11 col-xs-1">
  <a href="#toc-toggle" class="btn toc-btn" id="toc-toggle">目次</a>
</div>
<p>
Related <a href='index.html'>Index</a>
</p>
<div id="outline-container-org40dfd00" class="outline-2">
<h2 id="org40dfd00">始めに</h2>
<div class="outline-text-2" id="text-org40dfd00">
<p>
どんなシステムでも, かならずやっている雑多な設定などをメモ書き.
増えてきたらそのうち分離する予定.
</p>
</div>
</div>
<div id="outline-container-org286ce85" class="outline-2">
<h2 id="org286ce85">sudo の設定</h2>
<div class="outline-text-2" id="text-org286ce85">
<p>
squeeze 以降は sudo グループがあるので, 自分を sudo グループに追加して再ログインした後に作業する.
</p>
<pre class="example">
# adduser [アカウント] sudo
</pre>
<p>
squeeze より前なら visudo で自分を追加してユーザアカウントでログインして作業.
</p>
<pre class="example">
# visudo
</pre>
</div>
</div>
<div id="outline-container-org41d5106" class="outline-2">
<h2 id="org41d5106">keymap の変更</h2>
<div class="outline-text-2" id="text-org41d5106">
<p>
console-setup で設定するようになった.
X のキーボード設定もこれで設定される.
<code>/etc/default/console-setup</code> が <code>/etc/default/keyboad</code> を見に行き,
ファイルが存在すればその内容を読むようになっている.
現状は以下の通り:
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #7F7FFF;">BACKSPACE</span>=<span style="color: #7FFF7F;">"guess"</span>
<span style="color: #7F7FFF;">XKBLAYOUT</span>=<span style="color: #7FFF7F;">"jp"</span>
<span style="color: #7F7FFF;">XKBMODEL</span>=<span style="color: #7FFF7F;">"pc105"</span>
<span style="color: #7F7FFF;">XKBVARIANT</span>=<span style="color: #7FFF7F;">""</span>
<span style="color: #7F7FFF;">XKBOPTIONS</span>=<span style="color: #7FFF7F;">"ctrl:nocaps"</span>
</pre>
</div>
<p>
その後で
</p>
<pre class="example">
% sudo /etc/init.d/console-setup restart
</pre>
</div>
</div>
<div id="outline-container-orgfdca897" class="outline-2">
<h2 id="orgfdca897">MTA の設定</h2>
<div class="outline-text-2" id="text-orgfdca897">
<ul class="org-ul">
<li>常にネットワークに接続されているデスクトップ/ワークステーションは
SSMTP を使用して上流のメールサーバに転送.</li>
<li>モバイル環境のノートでは Exim4 を local 配送のみに設定して使用中.
<ul class="org-ul">
<li>(2014/07/26) Exim4の設定を移動→<a href='DebianMTA.html'>MTA の設定</a></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org16f69b6" class="outline-3">
<h3 id="org16f69b6">SSMTP</h3>
<div class="outline-text-3" id="text-org16f69b6">
<p>
.qmail や .forward など, 上流のメールサーバで転送設定をしておく.
</p>

<p>
SSMTP を動かしたい計算機でインストールと設定.
以下
</p>
<ul class="org-ul">
<li>メールサーバ:mail.my.domain</li>
<li>メールサーバのアカウント: account</li>
<li>SSMTP の動作する計算機: hostname.my.domain</li>
</ul>
<p>
のつもりで.
</p>
<pre class="example">
$ sudo -s
# aptitude install ssmtp
  ユーザ ID が 1000 未満のメールを受け取るユーザ: account-hostname@my.domain
  メールハブの名前: mail.my.domain
  リモート SMTP サーバのポート番号: [空白]
  どのドメインとして送信するか: mail.my.domain
  FQDN (完全修飾ドメイン名): hostname.my.domain
  メールヘッダの From: 行の上書きを許可しますか?: NO
</pre>
<p>
ついでに /etc/crontab に MAILTO を追記しておく.
SMTP-AUTH over SSL に対応したい場合は, /etc/ssmtp/ssmtp.conf に
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #7F7FFF;">AuthUser</span>=[SMTP-AUTH &#12398;&#12518;&#12540;&#12470;&#21517;]
<span style="color: #7F7FFF;">AuthPass</span>=[SMTP-AUTH &#12398;&#12497;&#12473;&#12527;&#12540;&#12489;]
<span style="color: #7F7FFF;">UseTLS</span>=YES
</pre>
</div>
<p>
と書いておくと良い.
</p>
</div>
</div>
</div>
<div id="outline-container-org5079f0c" class="outline-2">
<h2 id="org5079f0c">alsa の初期設定</h2>
<div class="outline-text-2" id="text-org5079f0c">
<p>
あんまり複雑な事をしなくて良い機材だと楽.
とりあえず alsa で音がなるようにしておく.
</p>
<pre class="example">
$ sudo aptitide install alsa-base alsa-utils mpg123
$ sudo alsaconf
$ alsamixer
</pre>
<p>
alsamixer で mute を外していないと音が鳴らないので注意.
</p>

<p>
VAIO type G ではイヤホン差しても外部出力が mute にならないので,
明示的に mute しておく必要がある.
また snd-hda-intel module の読み込み時に "model=basic" を指定しておかないと
alsamixer での表示が悲しい感じになる.
<code>/etc/modprobe.d/alsa-base.conf</code> の末尾に
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #7F7FFF;">options snd-hda-intel model</span>=basic
</pre>
</div>
<p>
なんて追記しておくと良い.
</p>
</div>
</div>
